README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ru" xml:lang="ru">
<head>
<!-- 2025-11-01 Сб 12:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>cl-git-tree</title>
<meta name="author" content="Mykola Matvyeyev" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">cl-git-tree</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgefbb7b9">1. Описание</a></li>
<li><a href="#org2339fac">2. Возможности</a></li>
<li><a href="#org2784a86">3. Архитектура</a></li>
<li><a href="#org9e31bd7">4. Установка</a></li>
<li><a href="#org4cf311e">5. Использование</a></li>
<li><a href="#orgcd806cd">6. Лицензия</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgefbb7b9" class="outline-2">
<h2 id="orgefbb7b9"><span class="section-number-2">1.</span> Описание</h2>
<div class="outline-text-2" id="text-1">
<p>
cl-git-tree — инструмент для управления git‑локациями и синхронизации репозиториев,
написанный на Common Lisp.  
Он позволяет регистрировать шаблоны локаций, строить URL для репозиториев,
автоматизировать операции clone/unclone и управлять удалёнными репозиториями.
</p>
</div>
</div>
<div id="outline-container-org2339fac" class="outline-2">
<h2 id="org2339fac"><span class="section-number-2">2.</span> Возможности</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Регистрация и хранение локаций в глобальной таблице <b>locations</b>.</li>
<li>Построение git‑URL на основе шаблонов.</li>
<li>Поддержка локальных путей, UNC и архивов (.tar, .xz).</li>
<li>Набор команд для работы с репозиториями:
<ul class="org-ul">
<li>clone / unclone</li>
<li>pull / push / commit / add</li>
<li>remote‑add / remote‑remove / remote‑readd</li>
<li>remake‑xz, info, aliases</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org2784a86" class="outline-2">
<h2 id="org2784a86"><span class="section-number-2">3.</span> Архитектура</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>cl-git-tree</code> — основная система, объединяющая подсистемы и команды.</li>
<li><code>cl-git-tree/loc</code> — подсистема для работы с локациями (&lt;location&gt;, <b>locations</b>, API).</li>
<li><code>cl-git-tree/git-utils</code> — вспомогательные функции для работы с git.</li>
<li><code>src/commands/</code> — набор CLI‑команд.</li>
<li><code>src/fs/</code> — подсистема для работы с файловой системой.</li>
</ul>
</div>
</div>
<div id="outline-container-org9e31bd7" class="outline-2">
<h2 id="org9e31bd7"><span class="section-number-2">4.</span> Установка</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-lisp">(ql:quickload <span style="color: #79a8ff;">"cl-git-tree"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4cf311e" class="outline-2">
<h2 id="org4cf311e"><span class="section-number-2">5.</span> Использование</h2>
<div class="outline-text-2" id="text-5">
<p>
Пример регистрации локации и клонирования репозитория:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(cl-git-tree/loc:add-location <span style="color: #79a8ff;">"gh"</span>
  <span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"GitHub"</span>
  <span style="color: #f78fe7;">:url-git</span> <span style="color: #79a8ff;">"https://github.com/"</span>)

(cl-git-tree/loc:repo-url <span style="color: #79a8ff;">"gh"</span> <span style="color: #79a8ff;">"cl-git-tree"</span>)
<span style="color: #989898;">;; </span><span style="color: #989898;">=&gt; "https://github.com/cl-git-tree.git"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcd806cd" class="outline-2">
<h2 id="orgcd806cd"><span class="section-number-2">6.</span> Лицензия</h2>
<div class="outline-text-2" id="text-6">
<p>
Проект распространяется под лицензией GNU GPL v3 или более поздней версии.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#1040;&#1074;&#1090;&#1086;&#1088;: Mykola Matvyeyev</p>
<p class="date">Created: 2025-11-01 Сб 12:11</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
